In [2]:
import pandas as pd

import numpy as np

In [8]:
df = pd.read_csv(r'D:\2213002\adult.csv')

In [10]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [12]:
df.tail()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
48837,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [15]:
df.shape

(48842, 15)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [20]:
df.describe()

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
count,48842.000000,4.884200e+04,48842.000000,48842.000000,48842.000000,48842.000000
mean,38.643585,1.896641e+05,10.078089,1079.067626,87.502314,40.422382
std,13.710510,1.056040e+05,2.570973,7452.019058,403.004552,12.391444
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.175505e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.781445e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.376420e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,4356.000000,99.000000

In [22]:
df.isna().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [24]:
df.duplicated().sum()

52

In [26]:
df=df.drop_duplicates()

In [29]:
df.isin(['?']).sum()

age                   0
workclass          2795
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2805
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      856
income                0
dtype: int64

In [31]:
df = df.replace('?',np.nan)

In [34]:
df.isna().sum()

age                   0
workclass          2795
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2805
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      856
income                0
dtype: int64

In [55]:
temp = pd.DataFrame({
    "Name":['Abc',"PQR", np.nan,"XYZ"],
    "Roll No":[1,np.nan,3,4]
})

In [56]:
temp

  Name  Roll No
0  Abc      1.0
1  PQR      NaN
2  NaN      3.0
3  XYZ      4.0

In [57]:
temp.fillna(method='ffill',inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_12444\2967702086.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  temp.fillna(method='ffill',inplace=True)

In [78]:
temp

  Name  Roll No
0  Abc      1.0
1  PQR      1.0
2  PQR      3.0
3  XYZ      4.0

In [80]:
print(df['gender'].unique())

['Male' 'Female']

In [82]:
df['gender']=df['gender'].replace('Male',1)
df['gender']=df['gender'].replace('Femake',0)

In [105]:
temp_df = pd.DataFrame({
    'Fruit_Name' : ('Mango','Apple', 'Orange', 'Guava'),
    'Fruit_Color': ('Yellow', 'Red', 'Orange', 'Green' ),
    'Fruit_Price': (500, 300, 120, 250)
})

In [112]:
temp_df

,Fruit_Name,Fruit_Price,Fruit_Color_Green,Fruit_Color_Orange,Fruit_Color_Red,Fruit_Color_Yellow
0,2,500,False,False,False,True
1,0,300,False,False,True,False
2,3,120,False,True,False,False
3,1,250,True,False,False,False

In [117]:
print(df['income'].unique())

['<=50K' '>50K']

In [120]:
df['income']=df['income'].replace('<=50k',0)
df['income']=df['income'].replace('>50k',1)

In [123]:
print(df['marital-status'].unique())

['Never-married' 'Married-civ-spouse' 'Widowed' 'Divorced' 'Separated'
 'Married-spouse-absent' 'Married-AF-spouse']

In [126]:
df['marital-status'] = df['marital-status'].replace('Never-married', 'Unmarried')
df['marital-status'] = df['marital-status'].replace('Married-AF-spouse', 'Married')
df['marital-status'] = df['marital-status'].replace('Married-civ-spouse', 'Married')
df['marital-status'] = df['marital-status'].replace('Married-spouse-absent', 'Unmarried')
df['marital-status'] = df['marital-status'].replace('Seperated', 'Seperated')
df['marital-status'] = df['marital-status'].replace('Seperated', 'Unmarried')
df['marital-status'] = df['marital-status'].replace('Widowed', 'Widowed')

In [129]:
df['marital-status']=lbl_encoder.fit_transform(df['marital-status'])

In [130]:
print(df['marital-status'].unique())

[3 1 4 0 2]